teddokano/r01lib_serial/_r01lib_frdm_mcxn236/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MCXN236
package_id: MCXN236VDF
mcu_data: ksdk2_0
processor_version: 16.3.0
pin_labels:
- {pin_num: A1, pin_signal: PIO1_8/WUU0_IN10/LPTMR1_ALT3/TRACE_DATA0/FC4_P0/FC5_P4/CT_INP8/FLEXIO0_D16/EZH_PIO4/I3C1_SDA/ADC1_A8, label: 'P1_8/J9[12]', identifier: DEBUG_UART_RX}
- {pin_num: B1, pin_signal: PIO1_9/TRACE_DATA1/FC4_P1/FC5_P5/CT_INP9/FLEXIO0_D17/EZH_PIO5/I3C1_SCL/ADC1_A9, label: 'P1_9/J9[11]', identifier: DEBUG_UART_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B16, peripheral: SWD, signal: SWO, pin_signal: PIO0_2/TDO/SWO/FC1_P2/CT0_MAT0/UTICK_CAP0/I3C0_PUR, slew_rate: fast, open_drain: disable, drive_strength: high,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: E11, peripheral: UTICK0, signal: 'CAPTURE, 0', pin_signal: PIO0_14/FC1_P6/FC0_P2/CT_INP2/UTICK_CAP0/FLEXIO0_D6/ADC0_B14}
  - {pin_num: N7, peripheral: GPIO4, signal: 'GPIO, 6', pin_signal: PIO4_6/TRIG_OUT4/FC2_P6/CT_INP18/EZH_PIO30/ADC0_A3/ADC1_A3}
  - {pin_num: T8, peripheral: GPIO4, signal: 'GPIO, 15', pin_signal: PIO4_15/WUU0_IN21/TRIG_OUT4/USB1_VBUS_DIG/CT4_MAT3/FLEXIO0_D23/CAN1_RXD/ADC0_A1/CMP0_IN4P}
  - {pin_num: R8, peripheral: GPIO4, signal: 'GPIO, 16', pin_signal: PIO4_16/FC2_P2/USB1_OTG_PWR/CT3_MAT0/FLEXIO0_D24/CAN1_TXD/ADC0_A6}
  - {pin_num: R9, peripheral: GPIO4, signal: 'GPIO, 17', pin_signal: PIO4_17/TRIG_IN9/FC2_P3/USB1_OTG_OC/CT3_MAT1/FLEXIO0_D25/ADC0_B6}
  - {pin_num: T7, peripheral: GPIO4, signal: 'GPIO, 13', pin_signal: PIO4_13/TRIG_IN8/FC2_P1/USB1_ID/USB1_OTG_ID/CT4_MAT1/FLEXIO0_D21/CAN0_TXD/ADC0_B5/ADC1_B5}
  - {pin_num: T6, peripheral: GPIO4, signal: 'GPIO, 12', pin_signal: PIO4_12/WUU0_IN20/FC2_P0/CT4_MAT0/FLEXIO0_D20/CAN0_RXD/ADC0_A5/ADC1_A5}
  - {pin_num: U1, peripheral: GPIO4, signal: 'GPIO, 3', pin_signal: PIO4_3/WUU0_IN19/TRIG_IN7/FC2_P3/CT_INP13/EZH_PIO27/ADC0_B4/ADC1_B4/CMP0_IN5N/CMP1_IN5N}
  - {pin_num: T1, peripheral: GPIO4, signal: 'GPIO, 2', pin_signal: PIO4_2/TRIG_IN6/FC2_P2/CT_INP12/EZH_PIO26/ADC0_A4/ADC1_A4/CMP0_IN4N/CMP1_IN4N}
  - {pin_num: G16, peripheral: GPIO3, signal: 'GPIO, 12', pin_signal: PIO3_12/FC7_P4/FC6_P4/CT1_MAT2/PWM1_A0/FLEXIO0_D20/EZH_PIO12/SAI0_RXD1}
  - {pin_num: K15, peripheral: GPIO3, signal: 'GPIO, 17', pin_signal: PIO3_17/WUU0_IN26/CT_INP9/PWM1_B2/FLEXIO0_D25/EZH_PIO17/SAI1_TX_FS}
  - {pin_num: H17, peripheral: GPIO3, signal: 'GPIO, 14', pin_signal: PIO3_14/WUU0_IN25/CT_INP6/PWM1_A1/FLEXIO0_D22/EZH_PIO14/SAI0_RX_BCLK}
  - {pin_num: M10, peripheral: GPIO5, signal: 'GPIO, 2', pin_signal: PIO5_2/VBAT_WAKEUP_b/SPC_LPREQ/TAMPER0/ADC1_B10}
  - {pin_num: N11, peripheral: GPIO5, signal: 'GPIO, 3', pin_signal: PIO5_3/TRIG_IN11/RTC_CLKOUT/TAMPER1/ADC1_B11}
  - {pin_num: K13, peripheral: GPIO5, signal: 'GPIO, 6', pin_signal: PIO5_6/TRIG_OUT6/LPTMR1_ALT2/TAMPER4/ADC1_B14}
  - {pin_num: U17, peripheral: GPIO5, signal: 'GPIO, 1', pin_signal: PIO5_1/TRIG_OUT6/LPTMR1_ALT2/XTAL32K/ADC1_B9}
  - {pin_num: U16, peripheral: GPIO5, signal: 'GPIO, 0', pin_signal: PIO5_0/TRIG_IN10/LPTMR0_ALT2/EXTAL32K/ADC1_B8}
  - {pin_num: H2, peripheral: GPIO2, signal: 'GPIO, 0', pin_signal: PIO2_0/TRIG_IN5/PWM1_A3/FLEXIO0_D8/EZH_PIO20/SAI0_RX_BCLK}
  - {pin_num: C6, peripheral: GPIO1, signal: 'GPIO, 0', pin_signal: PIO1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/FC3_P0/FC4_P4/CT_INP4/FLEXIO0_D8/SAI1_TX_BCLK/ADC0_A16/CMP0_IN0}
  - {pin_num: C5, peripheral: GPIO1, signal: 'GPIO, 1', pin_signal: PIO1_1/TRIG_IN1/FC3_P1/FC4_P5/CT_INP5/FLEXIO0_D9/SAI1_TX_FS/ADC0_A17/CMP1_IN0}
  - {pin_num: C4, peripheral: GPIO1, signal: 'GPIO, 2', pin_signal: PIO1_2/TRIG_OUT0/FC3_P2/FC4_P6/CT1_MAT0/FLEXIO0_D10/SAI1_TXD0/CAN0_TXD/ADC0_A18}
  - {pin_num: B4, peripheral: GPIO1, signal: 'GPIO, 3', pin_signal: PIO1_3/WUU0_IN7/TRIG_OUT1/FC3_P3/CT1_MAT1/FLEXIO0_D11/SAI1_RXD0/CAN0_RXD/ADC0_A19/CMP0_IN1}
  - {pin_num: B7, peripheral: GPIO0, signal: 'GPIO, 23', pin_signal: PIO0_23/WUU0_IN5/EWM0_OUT_b/FC1_P3/CT_INP3/FLEXIO0_D7/ADC0_A15}
  - {pin_num: B8, peripheral: GPIO0, signal: 'GPIO, 22', pin_signal: PIO0_22/EWM0_IN/FC0_P6/FC1_P2/CT_INP2/FLEXIO0_D6/I3C0_PUR/ADC0_A14/CMP1_IN2}
  - {pin_num: C8, peripheral: GPIO0, signal: 'GPIO, 20', pin_signal: PIO0_20/WUU0_IN4/FC0_P4/FC1_P0/CT_INP0/FLEXIO0_D4/I3C0_SDA/ADC0_A12}
  - {pin_num: C14, peripheral: GPIO0, signal: 'GPIO, 6', pin_signal: PIO0_6/ISPMODE_N/FC0_P2/FC1_P6/CT_INP2/PDM0_DATA1/CLKOUT}
  - {pin_num: N10, peripheral: GPIO4, signal: 'GPIO, 18', pin_signal: PIO4_18/CT3_MAT2/FLEXIO0_D26}
  - {pin_num: P1, peripheral: GPIO4, signal: 'GPIO, 0', pin_signal: PIO4_0/WUU0_IN18/TRIG_IN6/FC2_P0/CT_INP16/EZH_PIO24/ADC0_A0}
  - {pin_num: P2, peripheral: GPIO4, signal: 'GPIO, 1', pin_signal: PIO4_1/TRIG_IN7/FC2_P1/CT_INP17/EZH_PIO25/ADC0_B0}
  - {pin_num: L2, peripheral: GPIO2, signal: 'GPIO, 7', pin_signal: PIO2_7/TRIG_IN5/PWM1_B0/FLEXIO0_D15/EZH_PIO27/SAI0_TX_FS}
  - {pin_num: E4, peripheral: I3C1, signal: PUR, pin_signal: PIO1_15/WUU0_IN13/FC3_P3/CT_INP11/FLEXIO0_D23/EZH_PIO11/I3C1_PUR/ADC1_A15}
  - {pin_num: F6, peripheral: GPIO1, signal: 'GPIO, 16', pin_signal: PIO1_16/WUU0_IN14/FC5_P0/FC3_P4/CT_INP12/FLEXIO0_D24/EZH_PIO12/I3C1_SDA/ADC1_A16}
  - {pin_num: F4, peripheral: GPIO1, signal: 'GPIO, 17', pin_signal: PIO1_17/FC5_P1/FC3_P5/CT_INP13/FLEXIO0_D25/EZH_PIO13/I3C1_SCL/ADC1_A17}
  - {pin_num: T11, peripheral: GPIO4, signal: 'GPIO, 21', pin_signal: PIO4_21/TRIG_IN9/FC2_P5/CT2_MAT1/FLEXIO0_D29/ADC1_B6}
  - {pin_num: J15, peripheral: GPIO3, signal: 'GPIO, 16', pin_signal: PIO3_16/CT_INP8/PWM1_A2/FLEXIO0_D24/EZH_PIO16/SAI1_TX_BCLK}
  - {pin_num: H15, peripheral: GPIO3, signal: 'GPIO, 15', pin_signal: PIO3_15/CT_INP7/PWM1_B1/FLEXIO0_D23/EZH_PIO15/SAI0_RX_FS}
  - {pin_num: C10, peripheral: GPIO0, signal: 'GPIO, 18', pin_signal: PIO0_18/EWM0_IN/FC0_P2/CT0_MAT2/FLEXIO0_D2/HSCMP0_OUT/PDM0_DATA1/ADC0_A10}
  - {pin_num: B10, peripheral: GPIO0, signal: 'GPIO, 16', pin_signal: PIO0_16/WUU0_IN2/FC0_P0/CT0_MAT0/UTICK_CAP2/FLEXIO0_D0/PDM0_CLK/I3C0_SDA/ADC0_A8}
  - {pin_num: B10, peripheral: WUU0, signal: 'P, 2', pin_signal: PIO0_16/WUU0_IN2/FC0_P0/CT0_MAT0/UTICK_CAP2/FLEXIO0_D0/PDM0_CLK/I3C0_SDA/ADC0_A8}
  - {pin_num: A10, peripheral: GPIO0, signal: 'GPIO, 17', pin_signal: PIO0_17/FC0_P1/CT0_MAT1/UTICK_CAP3/FLEXIO0_D1/PDM0_DATA0/I3C0_SCL/ADC0_A9}
  - {pin_num: L13, peripheral: GPIO5, signal: 'GPIO, 7', pin_signal: PIO5_7/TRIG_IN11/TAMPER5/ADC1_B15}
  - {pin_num: M12, peripheral: GPIO5, signal: 'GPIO, 4', pin_signal: PIO5_4/TRIG_OUT7/SPC_LPREQ/TAMPER2/ADC1_B12}
  - {pin_num: K12, peripheral: GPIO5, signal: 'GPIO, 5', pin_signal: PIO5_5/TRIG_IN10/LPTMR0_ALT2/TAMPER3/ADC1_B13}
  - {pin_num: B6, peripheral: GPIO0, signal: 'GPIO, 24', pin_signal: PIO0_24/FC1_P0/CT0_MAT0/ADC0_B16}
  - {pin_num: A6, peripheral: GPIO0, signal: 'GPIO, 25', pin_signal: PIO0_25/FC1_P1/CT0_MAT1/ADC0_B17}
  - {pin_num: F10, peripheral: GPIO0, signal: 'GPIO, 26', pin_signal: PIO0_26/FC1_P2/CT0_MAT2/ADC0_B18}
  - {pin_num: E10, peripheral: GPIO0, signal: 'GPIO, 27', pin_signal: PIO0_27/FC1_P3/CT0_MAT3/ADC0_B19}
  - {pin_num: E8, peripheral: GPIO0, signal: 'GPIO, 28', pin_signal: PIO0_28/FC1_P4/FC0_P4/CT_INP0/ADC0_B20}
  - {pin_num: F8, peripheral: GPIO0, signal: 'GPIO, 29', pin_signal: PIO0_29/FC1_P5/FC0_P5/CT_INP1/ADC0_B21}
  - {pin_num: M1, peripheral: GPIO2, signal: 'GPIO, 9', pin_signal: PIO2_9/TRACE_DATA1/PWM1_X1/FLEXIO0_D17/EZH_PIO29/SAI1_RXD0}
  - {pin_num: A2, peripheral: GPIO1, signal: 'GPIO, 7', pin_signal: PIO1_7/WUU0_IN9/TRIG_OUT2/FC5_P3/CT_INP7/FLEXIO0_D15/EZH_PIO3/SAI1_RX_FS/CAN1_RXD/ADC0_A23}
  - {pin_num: A2, peripheral: WUU0, signal: 'P, 9', pin_signal: PIO1_7/WUU0_IN9/TRIG_OUT2/FC5_P3/CT_INP7/FLEXIO0_D15/EZH_PIO3/SAI1_RX_FS/CAN1_RXD/ADC0_A23}
  - {pin_num: K16, peripheral: GPIO3, signal: 'GPIO, 18', pin_signal: PIO3_18/FC6_P6/CT2_MAT0/PWM1_X0/FLEXIO0_D26/EZH_PIO18/SAI1_RX_BCLK}
  - {pin_num: D17, peripheral: GPIO3, signal: 'GPIO, 6', pin_signal: PIO3_6/CLKOUT/FC6_P1/CT4_MAT2/PWM0_A1/FLEXIO0_D14/EZH_PIO6/SAI1_MCLK/FREQME_CLK_OUT1}
  - {pin_num: M2, peripheral: GPIO2, signal: 'GPIO, 8', pin_signal: PIO2_8/TRACE_DATA0/PWM1_X0/FLEXIO0_D16/EZH_PIO28/SAI1_TXD0}
  - {pin_num: A8, peripheral: GPIO0, signal: 'GPIO, 21', pin_signal: PIO0_21/FC0_P5/FC1_P1/CT_INP1/FLEXIO0_D5/I3C0_SCL/ADC0_A13}
  - {pin_num: D1, peripheral: GPIO1, signal: 'GPIO, 13', pin_signal: PIO1_13/TRIG_IN3/FC4_P5/FC3_P1/CT2_MAT3/FLEXIO0_D21/EZH_PIO9/CAN1_TXD/ADC1_A13}
  - {pin_num: M6, peripheral: GPIO4, signal: 'GPIO, 4', pin_signal: PIO4_4/FC2_P4/CT_INP14/EZH_PIO28/ADC1_A0}
  - {pin_num: M8, peripheral: GPIO4, signal: 'GPIO, 5', pin_signal: PIO4_5/FC2_P5/CT_INP15/EZH_PIO29/ADC1_B0}
  - {pin_num: B14, peripheral: GPIO0, signal: 'GPIO, 4', pin_signal: PIO0_4/WUU0_IN0/EWM0_IN/FC0_P0/FC1_P4/CT0_MAT2/UTICK_CAP2/HSCMP1_OUT/PDM0_CLK}
  - {pin_num: B14, peripheral: WUU0, signal: 'P, 0', pin_signal: PIO0_4/WUU0_IN0/EWM0_IN/FC0_P0/FC1_P4/CT0_MAT2/UTICK_CAP2/HSCMP1_OUT/PDM0_CLK}
  - {pin_num: C13, peripheral: GPIO0, signal: 'GPIO, 7', pin_signal: PIO0_7/WUU0_IN1/FC0_P3/CT_INP3}
  - {pin_num: C13, peripheral: WUU0, signal: 'P, 1', pin_signal: PIO0_7/WUU0_IN1/FC0_P3/CT_INP3}
  - {pin_num: D3, peripheral: GPIO1, signal: 'GPIO, 11', pin_signal: PIO1_11/WUU0_IN11/TRACE_DATA3/FC4_P3/CT2_MAT1/FLEXIO0_D19/EZH_PIO7/I3C1_PUR/CAN0_RXD/ADC1_A11}
  - {pin_num: D3, peripheral: WUU0, signal: 'P, 11', pin_signal: PIO1_11/WUU0_IN11/TRACE_DATA3/FC4_P3/CT2_MAT1/FLEXIO0_D19/EZH_PIO7/I3C1_PUR/CAN0_RXD/ADC1_A11}
  - {pin_num: B3, peripheral: GPIO1, signal: 'GPIO, 5', pin_signal: PIO1_5/FREQME_CLK_IN1/FC3_P5/FC5_P1/CT1_MAT3/FLEXIO0_D13/EZH_PIO1/SAI0_RXD1/ADC0_A21/CMP0_IN3}
  - {pin_num: G5, peripheral: GPIO1, signal: 'GPIO, 19', pin_signal: PIO1_19/WUU0_IN15/FREQME_CLK_IN1/FC5_P3/CT3_MAT1/FLEXIO0_D27/EZH_PIO15/CAN0_RXD/ADC1_A19}
  - {pin_num: G5, peripheral: WUU0, signal: 'P, 15', pin_signal: PIO1_19/WUU0_IN15/FREQME_CLK_IN1/FC5_P3/CT3_MAT1/FLEXIO0_D27/EZH_PIO15/CAN0_RXD/ADC1_A19}
  - {pin_num: C9, peripheral: GPIO0, signal: 'GPIO, 19', pin_signal: PIO0_19/WUU0_IN3/EWM0_OUT_b/FC0_P3/CT0_MAT3/FLEXIO0_D3/HSCMP1_OUT/ADC0_A11}
  - {pin_num: C9, peripheral: WUU0, signal: 'P, 3', pin_signal: PIO0_19/WUU0_IN3/EWM0_OUT_b/FC0_P3/CT0_MAT3/FLEXIO0_D3/HSCMP1_OUT/ADC0_A11}
  - {pin_num: H1, peripheral: GPIO2, signal: 'GPIO, 1', pin_signal: PIO2_1/TRACE_CLK/PWM1_B3/FLEXIO0_D9/EZH_PIO21/SAI0_RX_FS}
  - {pin_num: D2, peripheral: GPIO1, signal: 'GPIO, 12', pin_signal: PIO1_12/WUU0_IN12/TRACE_CLK/FC4_P4/FC3_P0/CT2_MAT2/FLEXIO0_D20/EZH_PIO8/CAN1_RXD/ADC1_A12}
  - {pin_num: D2, peripheral: WUU0, signal: 'P, 12', pin_signal: PIO1_12/WUU0_IN12/TRACE_CLK/FC4_P4/FC3_P0/CT2_MAT2/FLEXIO0_D20/EZH_PIO8/CAN1_RXD/ADC1_A12}
  - {pin_num: N4, peripheral: GPIO2, signal: 'GPIO, 11', pin_signal: PIO2_11/TRACE_DATA3/PWM1_X3/FLEXIO0_D19/EZH_PIO30/SAI1_TXD1}
  - {pin_num: M3, peripheral: GPIO2, signal: 'GPIO, 10', pin_signal: PIO2_10/TRACE_DATA2/PWM1_X2/FLEXIO0_D18/EZH_PIO31/SAI1_RXD1}
  - {pin_num: A14, peripheral: GPIO0, signal: 'GPIO, 5', pin_signal: PIO0_5/EWM0_OUT_b/FC0_P1/FC1_P5/CT0_MAT3/UTICK_CAP3/PDM0_DATA0}
  - {pin_num: H3, peripheral: GPIO2, signal: 'GPIO, 2', pin_signal: PIO2_2/WUU0_IN16/CLKOUT/PWM1_A2/FLEXIO0_D10/EZH_PIO22/SAI0_TXD0}
  - {pin_num: H3, peripheral: WUU0, signal: 'P, 16', pin_signal: PIO2_2/WUU0_IN16/CLKOUT/PWM1_A2/FLEXIO0_D10/EZH_PIO22/SAI0_TXD0}
  - {pin_num: C3, peripheral: GPIO1, signal: 'GPIO, 10', pin_signal: PIO1_10/TRACE_DATA2/FC4_P2/FC5_P6/CT2_MAT0/FLEXIO0_D18/EZH_PIO6/CAN0_TXD/ADC1_A10}
  - {pin_num: B2, peripheral: GPIO1, signal: 'GPIO, 6', pin_signal: PIO1_6/TRIG_IN2/FC3_P6/FC5_P2/CT_INP6/FLEXIO0_D14/EZH_PIO2/SAI1_RX_BCLK/CAN1_TXD/ADC0_A22}
  - {pin_num: A4, peripheral: GPIO1, signal: 'GPIO, 4', pin_signal: PIO1_4/WUU0_IN8/FREQME_CLK_IN0/FC3_P4/FC5_P0/CT1_MAT2/FLEXIO0_D12/EZH_PIO0/SAI0_TXD1/ADC0_A20/CMP0_IN2}
  - {pin_num: A4, peripheral: WUU0, signal: 'P, 8', pin_signal: PIO1_4/WUU0_IN8/FREQME_CLK_IN0/FC3_P4/FC5_P0/CT1_MAT2/FLEXIO0_D12/EZH_PIO0/SAI0_TXD1/ADC0_A20/CMP0_IN2}
  - {pin_num: G4, peripheral: GPIO1, signal: 'GPIO, 18', pin_signal: PIO1_18/FREQME_CLK_IN0/FC5_P2/FC3_P6/CT3_MAT0/FLEXIO0_D26/EZH_PIO14/CAN0_TXD/ADC1_A18}
  - {pin_num: D4, peripheral: GPIO1, signal: 'GPIO, 14', pin_signal: PIO1_14/FC4_P6/FC3_P2/CT_INP10/FLEXIO0_D22/EZH_PIO10/ADC1_A14}
  - {pin_num: F16, peripheral: GPIO3, signal: 'GPIO, 11', pin_signal: PIO3_11/WUU0_IN24/FC6_P3/FC7_P5/CT1_MAT1/PWM0_B3/FLEXIO0_D19/EZH_PIO11/SAI0_RXD0}
  - {pin_num: F16, peripheral: WUU0, signal: 'P, 24', pin_signal: PIO3_11/WUU0_IN24/FC6_P3/FC7_P5/CT1_MAT1/PWM0_B3/FLEXIO0_D19/EZH_PIO11/SAI0_RXD0}
  - {pin_num: F15, peripheral: GPIO3, signal: 'GPIO, 9', pin_signal: PIO3_9/FC6_P5/FC7_P2/CT_INP5/PWM0_B2/FLEXIO0_D17/EZH_PIO9/SAI0_TX_FS}
  - {pin_num: F17, peripheral: GPIO3, signal: 'GPIO, 10', pin_signal: PIO3_10/FC6_P2/FC7_P4/CT1_MAT0/PWM0_A3/FLEXIO0_D18/EZH_PIO10/SAI0_TXD0}
  - {pin_num: E14, peripheral: GPIO3, signal: 'GPIO, 8', pin_signal: PIO3_8/WUU0_IN23/FC6_P4/FC7_P0/CT_INP4/PWM0_A2/FLEXIO0_D16/EZH_PIO8/SAI0_TX_BCLK}
  - {pin_num: E14, peripheral: WUU0, signal: 'P, 23', pin_signal: PIO3_8/WUU0_IN23/FC6_P4/FC7_P0/CT_INP4/PWM0_A2/FLEXIO0_D16/EZH_PIO8/SAI0_TX_BCLK}
  - {pin_num: D14, peripheral: GPIO3, signal: 'GPIO, 7', pin_signal: PIO3_7/FC6_P6/FC7_P1/CT4_MAT3/PWM0_B1/FLEXIO0_D15/EZH_PIO7/SAI0_MCLK}
  - {pin_num: K2, peripheral: GPIO2, signal: 'GPIO, 6', pin_signal: PIO2_6/TRIG_IN4/PWM1_A0/FLEXIO0_D14/EZH_PIO26/SAI0_TX_BCLK}
  - {pin_num: K1, peripheral: GPIO2, signal: 'GPIO, 5', pin_signal: PIO2_5/TRIG_OUT3/PWM1_B1/FLEXIO0_D13/EZH_PIO25/SAI0_TXD1}
  - {pin_num: K3, peripheral: GPIO2, signal: 'GPIO, 4', pin_signal: PIO2_4/WUU0_IN17/PWM1_A1/FLEXIO0_D12/EZH_PIO24/SAI0_RXD1}
  - {pin_num: K3, peripheral: WUU0, signal: 'P, 17', pin_signal: PIO2_4/WUU0_IN17/PWM1_A1/FLEXIO0_D12/EZH_PIO24/SAI0_RXD1}
  - {pin_num: J3, peripheral: GPIO2, signal: 'GPIO, 3', pin_signal: PIO2_3/PWM1_B2/FLEXIO0_D11/EZH_PIO23/SAI0_RXD0}
  - {pin_num: D15, peripheral: GPIO3, signal: 'GPIO, 2', pin_signal: PIO3_2/FC7_P0/CT4_MAT0/PWM0_X0/FLEXIO0_D10/EZH_PIO2}
  - {pin_num: C15, peripheral: GPIO3, signal: 'GPIO, 1', pin_signal: PIO3_1/TRIG_IN1/FC6_P0/FC7_P6/CT_INP17/PWM0_B0/FLEXIO0_D9/EZH_PIO1/FREQME_CLK_OUT0}
  - {pin_num: B17, peripheral: GPIO3, signal: 'GPIO, 0', pin_signal: PIO3_0/WUU0_IN22/TRIG_IN0/FC7_P3/CT_INP16/PWM0_A0/FLEXIO0_D8/EZH_PIO0}
  - {pin_num: B17, peripheral: WUU0, signal: 'P, 22', pin_signal: PIO3_0/WUU0_IN22/TRIG_IN0/FC7_P3/CT_INP16/PWM0_A0/FLEXIO0_D8/EZH_PIO0}
  - {pin_num: G13, peripheral: GPIO0, signal: 'GPIO, 15', pin_signal: PIO0_15/FC0_P3/CT_INP3/UTICK_CAP1/FLEXIO0_D7/ADC0_B15}
  - {pin_num: U12, peripheral: GPIO4, signal: 'GPIO, 23', pin_signal: PIO4_23/TRIG_OUT5/FC2_P6/CT2_MAT3/FLEXIO0_D31/ADC0_A2/ADC0_B2/ADC1_B3}
  - {pin_num: R10, peripheral: GPIO4, signal: 'GPIO, 19', pin_signal: PIO4_19/TRIG_OUT5/CT3_MAT3/FLEXIO0_D27/ADC0_B1/CMP1_IN4P}
  - {pin_num: T10, peripheral: GPIO4, signal: 'GPIO, 20', pin_signal: PIO4_20/TRIG_IN8/FC2_P4/CT2_MAT0/FLEXIO0_D28/ADC1_A6}
  - {pin_num: N8, peripheral: GPIO4, signal: 'GPIO, 14', pin_signal: PIO4_14/CT4_MAT2/FLEXIO0_D22}
  - {pin_num: T4, peripheral: GPIO4, signal: 'GPIO, 7', pin_signal: PIO4_7/CT_INP19/EZH_PIO31}
  - {pin_num: A1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P0, pin_signal: PIO1_8/WUU0_IN10/LPTMR1_ALT3/TRACE_DATA0/FC4_P0/FC5_P4/CT_INP8/FLEXIO0_D16/EZH_PIO4/I3C1_SDA/ADC1_A8,
    identifier: ''}
  - {pin_num: B1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P1, pin_signal: PIO1_9/TRACE_DATA1/FC4_P1/FC5_P5/CT_INP9/FLEXIO0_D17/EZH_PIO5/I3C1_SCL/ADC1_A9, identifier: ''}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

